<a href="https://colab.research.google.com/github/KamilBienias/data-science/blob/main/training/analityk.edu.pl/pandas_tutorial/05_informacje_o_df.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# https://analityk.edu.pl/python-pandas-tutorial-szybki-przeglad-zawartosci-dataframe/

# **Python Pandas Tutorial – szybki przegląd zawartości DataFrame**

W poprzednich lekcjach nauczyliśmy się tworzyć DataFrame. W tej lekcji zobaczymy jak szybko i łatwo możemy uzyskać podstawowe informacje na jego temat, takie jak liczba rekordów, typy kolumn, informacje o brakujących danych Czy też w drugą stronę – informacje o zduplikowanych rekordach. Zaczynajmy!
Pod lupę weźmiemy zbiór danych lista miast, i na nim wykonamy wszystkie poniższe operacje.

In [1]:
# pobieram plik worldcities.csv
!wget -O worldcities.csv "https://drive.google.com/uc?export=download&id=1A0mhufhexmoLOlzbbfNS1MrcaCldmQaC"

import pandas as pd
miasta = pd.read_csv('worldcities.csv')

--2021-01-19 07:51:15--  https://drive.google.com/uc?export=download&id=1A0mhufhexmoLOlzbbfNS1MrcaCldmQaC
Resolving drive.google.com (drive.google.com)... 108.177.125.102, 108.177.125.113, 108.177.125.100, ...
Connecting to drive.google.com (drive.google.com)|108.177.125.102|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-0s-9o-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/tkr83bs6ss3jvr5n9cn5nmd5v518udiu/1611042675000/17661347493353663657/*/1A0mhufhexmoLOlzbbfNS1MrcaCldmQaC?e=download [following]
Warning: wildcards not supported in HTTP.
--2021-01-19 07:51:16--  https://doc-0s-9o-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/tkr83bs6ss3jvr5n9cn5nmd5v518udiu/1611042675000/17661347493353663657/*/1A0mhufhexmoLOlzbbfNS1MrcaCldmQaC?e=download
Resolving doc-0s-9o-docs.googleusercontent.com (doc-0s-9o-docs.googleusercontent.com)... 74.125.203.132, 2404:6800:4008:c03::84
Connecting to doc-0s-9o-docs.googleusercontent.com (doc-0s-9o-docs.googleusercontent.com)|74.125.203.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [text/csv]
Saving to: ‘worldcities.csv’

worldcities.csv         [ <=>                ]   2.73M  --.-KB/s    in 0.02s

2021-01-19 07:51:17 (177 MB/s) - ‘worldcities.csv’ saved [2859311]

## **Szybki podgląd DataFrame**

Skoro mamy już masz DataFrame to warto by było do niego zajrzeć. Najprościej jest to zrobić za pomoca funkcji head(), która wyświetli 5 pierwszych rekordów:

In [2]:
miasta.head()

      city city_ascii      lat  ...  capital  population          id
0    Tokyo      Tokyo  35.6897  ...  primary  37977000.0  1392685764
1  Jakarta    Jakarta  -6.2146  ...  primary  34540000.0  1360771077
2    Delhi      Delhi  28.6600  ...    admin  29617000.0  1356872604
3   Mumbai     Mumbai  18.9667  ...    admin  23355000.0  1356226629
4   Manila     Manila  14.5958  ...  primary  23088000.0  1608618140

[5 rows x 11 columns]

Analogiczny wynik otrzymalibyśmy stosując użycie nawiasów kwadratowych o których będziemy mówić więcej w kolejnych lekcjach:

In [3]:
miasta[:5]

      city city_ascii      lat  ...  capital  population          id
0    Tokyo      Tokyo  35.6897  ...  primary  37977000.0  1392685764
1  Jakarta    Jakarta  -6.2146  ...  primary  34540000.0  1360771077
2    Delhi      Delhi  28.6600  ...    admin  29617000.0  1356872604
3   Mumbai     Mumbai  18.9667  ...    admin  23355000.0  1356226629
4   Manila     Manila  14.5958  ...  primary  23088000.0  1608618140

[5 rows x 11 columns]

Oddzielając liczby znakiem dwukropka ':' definiujemy zakres wierszy jakie chcemy aby zostały nam wyświetlone. Zupełnie jak w przypadku listy.

Jeżeli natomiast chcieli byśmy wyświetlić tylko 'ogon', czyli 5 ostatnich rekordów z naszego DataFrame, to możemy użyć funkcji tail()

In [4]:
miasta.tail()

              city   city_ascii      lat  ...  capital population          id
26564         Nord         Nord  81.7166  ...      NaN       10.0  1304217709
26565  Timmiarmiut  Timmiarmiut  62.5333  ...      NaN       10.0  1304206491
26566  Cheremoshna  Cheremoshna  51.3894  ...      NaN        0.0  1804043438
26567    Ambarchik    Ambarchik  69.6510  ...      NaN        0.0  1643739159
26568      Nordvik      Nordvik  74.0165  ...      NaN        0.0  1643587468

[5 rows x 11 columns]

Również bardzo łatwo możemy wyświetlić interesującą nas kolumnę. Wystarczy że w nawiasach kwadratowych podamy jej nazwę. Dla przykładu:

In [5]:
miasta["city"]

0              Tokyo
1            Jakarta
2              Delhi
3             Mumbai
4             Manila
            ...
26564           Nord
26565    Timmiarmiut
26566    Cheremoshna
26567      Ambarchik
26568        Nordvik
Name: city, Length: 26569, dtype: object

Aby szybko sprawdzić jakie wartości unikalne przyjmuje kolumna, wystarczy użyć funkcji unique():

In [6]:
miasta["capital"].unique()

array(['primary', 'admin', nan, 'minor'], dtype=object)

Jeżeli chcieli byśmy wyświetlić kilka konkretnych, to ich nazwy należy podać w liście:

In [7]:
miasta[["city", "iso3"]]

              city iso3
0            Tokyo  JPN
1          Jakarta  IDN
2            Delhi  IND
3           Mumbai  IND
4           Manila  PHL
...            ...  ...
26564         Nord  GRL
26565  Timmiarmiut  GRL
26566  Cheremoshna  UKR
26567    Ambarchik  RUS
26568      Nordvik  RUS

[26569 rows x 2 columns]

Alternatywnym sposobem jest podanie nazwy kolumny po kropce, tak jak tutaj:

In [9]:
miasta.city

0              Tokyo
1            Jakarta
2              Delhi
3             Mumbai
4             Manila
            ...
26564           Nord
26565    Timmiarmiut
26566    Cheremoshna
26567      Ambarchik
26568        Nordvik
Name: city, Length: 26569, dtype: object

Jednak w ten sposób możemy odwołać się tylko do jednej kolumny jednocześnie, i to pod warunkiem że jej nazwa nie zawiera spacji. No i jeszcze gwóźdź tego paragrafu, czyli jak wyświetlić konkretne wiersze dla konkretnych kolumn? Oczywiście w poprzez podanie w jednych nawiasach [] zakresu wierszy, a w drugich [] listy kolumn:

In [10]:
miasta[0:5][["city"]]

      city
0    Tokyo
1  Jakarta
2    Delhi
3   Mumbai
4   Manila

In [16]:
# inaczej, ale to w innym temacie poruszone.
# Tutaj wiersze są liczone włącznie z ostatnim
miasta.loc[0:4, ["city"]]

      city
0    Tokyo
1  Jakarta
2    Delhi
3   Mumbai
4   Manila

## **Wielkość, szerokość i typ danych w DataFrame**

Potrafimy już zajrzeć do naszego DataFrame. Pora dowiedzieć się jak łatwo możemy uzyskać informację na temat jego formy.

Mamy do dyspozycji 3 podstawowe funkcje które nam to bardzo ułatwią:

### **shape**

Zwraca informacje na temat liczby wierszy i liczby kolumn:

In [17]:
miasta.shape

(26569, 11)

### **info()**

Info() oferuje nam informacje na temat kolumn w naszym zbiorze, typu danych jaki jest w nich przechowywany oraz ilości rekordów które zawierają wartości. Czyli innych niż NaN

In [18]:
miasta.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26569 entries, 0 to 26568
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        26569 non-null  object
 1   city_ascii  26569 non-null  object
 2   lat         26569 non-null  float64
 3   lng         26569 non-null  float64
 4   country     26569 non-null  object
 5   iso2        26538 non-null  object
 6   iso3        26569 non-null  object
 7   admin_name  26493 non-null  object
 8   capital     7626 non-null   object
 9   population  25596 non-null  float64
 10  id          26569 non-null  int64
dtypes: float64(3), int64(1), object(7)
memory usage: 2.2+ MB

### **describe()**

I kolejne spojrzenie na kolumny, tym razem zawierające podstawowe statystyki dla kolumn przechowujących liczby.

In [19]:
miasta.describe()

                lat           lng    population            id
count  26569.000000  26569.000000  2.559600e+04  2.656900e+04
mean      33.095264    -11.363860  1.623457e+05  1.556097e+09
std       22.393678     73.946817  8.996585e+05  2.873890e+08
min      -54.934100   -179.590000  0.000000e+00  1.004003e+09
25%       27.918300    -78.779400  9.246000e+03  1.276656e+09
50%       40.218800     -0.768900  2.007950e+04  1.643148e+09
75%       47.987800     29.683300  5.936925e+04  1.840005e+09
max       81.716600    179.366700  3.797700e+07  1.934000e+09

Funkcję describe możemy równiż wykonać na konkretnej kolumny. Nie musimy tego robić dla całego zbioru:

In [21]:
miasta["population"].describe()

count    2.559600e+04
mean     1.623457e+05
std      8.996585e+05
min      0.000000e+00
25%      9.246000e+03
50%      2.007950e+04
75%      5.936925e+04
max      3.797700e+07
Name: population, dtype: float64

## **Puste wartości oraz duplikaty**

Potrafimy już całkiem sporo. Jednak są jeszcze 2 czynności które praktycznie zawsze wykonuje się na samym początku po utworzeniu DataFrame. Mianowicie sprawdzenie czy nasz zbiór zawiera brakujące lub zduplikowane wartości.

### **Brakujące wartości – NaN**

Podstawowe informacje na temat brakujących danych mogliśmy otrzymać za pomocą funkcji info(). Jednak mamy do dyspozycji jeszcze inne, bardzo użyteczne funkcje. Pierwszą z nich jest isnull(). Za jej pomocą otrzymamy informację czy dana komórka jest pusta czy nie:

In [22]:
miasta.isnull()

        city  city_ascii    lat    lng  ...  admin_name  capital  population     id
0      False       False  False  False  ...       False    False       False  False
1      False       False  False  False  ...       False    False       False  False
2      False       False  False  False  ...       False    False       False  False
3      False       False  False  False  ...       False    False       False  False
4      False       False  False  False  ...       False    False       False  False
...      ...         ...    ...    ...  ...         ...      ...         ...    ...
26564  False       False  False  False  ...       False     True       False  False
26565  False       False  False  False  ...       False     True       False  False
26566  False       False  False  False  ...       False     True       False  False
26567  False       False  False  False  ...       False     True       False  False
26568  False       False  False  False  ...       False     True       False  False

[26569 rows x 11 columns]

Jeżeli zsumujemy wyniki, to otrzymamy informację o brakujących wartościach dla danej kolumny:

In [23]:
miasta.isnull().sum()

city              0
city_ascii        0
lat               0
lng               0
country           0
iso2             31
iso3              0
admin_name       76
capital       18943
population      973
id                0
dtype: int64

Czyli na odwrót niż w przypadku informacji uzyskiwanych w przypadku funkcji info. Analogicznie mamy do dyspozycji funkcję notnull(), która zsymowana da nam wyniki takie same jak funkcja info():

In [24]:
miasta.notnull().sum()

city          26569
city_ascii    26569
lat           26569
lng           26569
country       26569
iso2          26538
iso3          26569
admin_name    26493
capital        7626
population    25596
id            26569
dtype: int64

### **Zduplikowane wartości**

Na zakończenie tej lekcji, jeszcze jedna rzecz, mianowicie namierzenie zduplikowanych rekordów. Informację o tym czy takie rekordy mamy czy też nie, możemy uzyskać za pomocą funkcji duplicated(), natomiast pozbyć się ich możemy za pomocą funkcji drop_duplicates(). W naszym zbiorze nie ma zduplikowanych rekordów, tak wiec wartość będzie zero, jednak w kolejnych lekcjach już na takie natrafimy.

In [26]:
miasta.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
26564    False
26565    False
26566    False
26567    False
26568    False
Length: 26569, dtype: bool

In [27]:
miasta.duplicated().sum()

0

In [29]:
# i tak nie ma czego usuwać
miasta.drop_duplicates()

              city   city_ascii      lat  ...  capital  population          id
0            Tokyo        Tokyo  35.6897  ...  primary  37977000.0  1392685764
1          Jakarta      Jakarta  -6.2146  ...  primary  34540000.0  1360771077
2            Delhi        Delhi  28.6600  ...    admin  29617000.0  1356872604
3           Mumbai       Mumbai  18.9667  ...    admin  23355000.0  1356226629
4           Manila       Manila  14.5958  ...  primary  23088000.0  1608618140
...            ...          ...      ...  ...      ...         ...         ...
26564         Nord         Nord  81.7166  ...      NaN        10.0  1304217709
26565  Timmiarmiut  Timmiarmiut  62.5333  ...      NaN        10.0  1304206491
26566  Cheremoshna  Cheremoshna  51.3894  ...      NaN         0.0  1804043438
26567    Ambarchik    Ambarchik  69.6510  ...      NaN         0.0  1643739159
26568      Nordvik      Nordvik  74.0165  ...      NaN         0.0  1643587468

[26569 rows x 11 columns]

Ćwiczenia

1. Należy wydrukować tylko i wyłącznie miasto oraz kraj, dla 10 pierwszych rekordów
2. Jakie unikalne wartości zawiera kolumna Capital?
3. Dla ilu miast brakuje informacji o ich populacji?

In [30]:
# 1.
miasta[:10][["city", "country"]]

          city       country
0        Tokyo         Japan
1      Jakarta     Indonesia
2        Delhi         India
3       Mumbai         India
4       Manila   Philippines
5     Shanghai         China
6    São Paulo        Brazil
7        Seoul  Korea, South
8  Mexico City        Mexico
9    Guangzhou         China

In [31]:
# 2.
miasta["capital"].unique()

array(['primary', 'admin', nan, 'minor'], dtype=object)

In [33]:
# 3.
miasta["population"].isnull().sum()

973